Repository: pvcraven/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/06_drawing/drawing.po
Languages: de

source: For a program showing all the drawing primitives, see the example `Drawing Primitives`_. Also, see the API documentation's `Quick Index`_.
de: Im Beispiel `Drawing Primitives`_, findest du ein Beispiel mit allen Zeichen-Primitiven. Schau ebenfalls in der API-Dokumentation `Quick Index`_ nach.

source: What's next? Try :ref:`lab-02`.
de: Was kommt als nächstes? Versuche die Aufgabe :ref:`lab-02`.
