Repository: pvcraven/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/06_drawing/drawing.po
Languages: de

source: How to Draw with Your Computer
de: Wie du mit deinem Rechner zeichnest

source: Finally, time to do start making graphics!
de: Endlich kommen wir dazu, ein paar Bilder zu erstellen!

source: By the end of this chapter, you should know how to write programs that will draw images on the screen. Below is an example of what one student did:
de: Am Ende dieses Kapitel solltest du wissen, wie du Programme schreibst, die Bilder auf den Bildschirm zeichnen. Unten ist ein Beispiel, das einer der Studierenden erstellt hat:

source: At the end of :ref:`lab-02` you can page through several other examples of what students have created for this lab.
de: Am Ende von :ref:`lab-02` kannst du durch die anderen Beispiele blättern, die Studierende für diese Aufgabe erstellt haben.

source: Creating a New Program
de: Erstellen eines neuen Programms

source: Open up PyCharm to the same project we created earlier. We'll use it for all our work this semester. Do **not** create new projects for each lab or program you create in this class. Just use one project for the entire class.
de: Starte PyCharm mit demselben Projekt, das wir vorher angelegt haben. Wir werden es für alle unsere Arbeiten in diesem Semester nutzen. Lege **kein** neues Projekt für die Aufgaben und Programme in diesem Kurs an. Benutze nur ein einziges Projekt für den Kurs.

source: We are going to create a lot of code samples as we go through the chapters. Let's create a directory in our project for these samples, away from the labs. Call it ``Code Samples``. Then create a Python source file for this chapter called ``drawing_samples.py``. Your system should look like this:
de: Wir werden eine Menge Code-Beispiele im Verlauf der Kapitel erstellen. Lass uns ein Verzeichnis in unserem Projekt für diese Beispiele anlegen, getrennt von den Aufgaben. Nenn es ``Code Samples``. Erstelle danach eine Python-Quelldatei ``drawing_samples.py`` für dieses Kapitel in diesem Verzeichnis. Dein System sollte wie folgt aussehen:

source: Comments
de: Kommentare

source: Before we begin learning to draw, we need to learn about **comments** in code. When typing in computer code, sometimes we want to be able to write things that the computer ignores. We call this "commenting our code." You will see a lot of comments in my code examples to explain how they work.
de: Bevor wir lernen zu zeichnen, wir müssen erst **Kommentare** im Code kennenlernen. Während der Eingabe von Programmcode wollen wir manchmal Dinge eingeben, die der Rechner ignoriert. Wir nennen das den Code "kommentieren". Du wirst eine Menge Kommentare in meinen Codebeispielen sehen, die erklären wie sie funktionieren.

source: Below are two ways of adding comments to code in the Python computer language:
de: Unten stehen zwei Arten, um Kommentare zu Python-Programmen hinzuzufügen.

source: Go ahead and try it. Multi-line comments usually start each source file and explain what the code does.
de: Mach weiter und probiere es aus. Mehrzeilige Kommentare stehen normalerweise am Anfang jeder Quelldatei und erklären, was der Code macht.

source: Let's try running the program. But before we run the program, we need to make sure we are running the *right* program. Look at the image below. If I select "run" with the green arrow, I will run ``lab_01.py``, *not* the program I want to run. You need to right-click on our program and select "Run ``drawing_sample.py``" instead.
de: Lass uns das Programm ausführen. Wir müssen aber sicherstellen, dass wir das *richtige* Programm ausführen, bevor wir es starten. Sie die Abbildung unten an. Wenn ich "run" mit dem grünen Pfeil auswähle, wird es ``lab_01.py`` und nicht das Programm, das ich starten will, ausführen. Du musst auf unser Programm rechtsklicken und "Run ``drawing_sample.py``" stattdessen auswählen.

source: Hey wait! When we finally run our program, nothing happens. That's because the only code that we wrote were "comments." Comments are ignored. Therefore, there was nothing for the computer to do. Read on.
de: Halt, warte! Wenn wir das Programm endlich ausführen, passiert nichts. Das ist, weil der einzige Programmcode, den wir geschrieben haben "Kommentare" waren. Kommentare werden ignoriert, deshalb war da nichts für den Rechner zu tun. Lies weiter.

source: Import the Arcade Library
de: Importiere die Arcade-Bibliothek

source: Before we can draw anything, we need to import a "library" of code that has commands for drawing.
de: Bevor wir etwas zeichnen können, müssen wir eine "Bibliothek" aus Programmcode importieren, die Anweisungen zum Zeichnen enthält.

source: Computer languages come with a set of built-in commands. Most programs will require *more* commands than what the computer language loads by default. These sets of commands are called **libraries**. Some languages have their own special term for these libraries. In the case of Python, they are called **modules**.
de: Programmiersprachen kommen mit einer Menge von eingebauten Anweisungen. Die meisten Programme werden *mehr* Anweisungen benötigen, als die Programmiersprache standardmäßig lädt. Diese Menge von Anweisungen werden **Bibliotheken** genannt. Manche Sprachen haben ihren eigenen Ausdruck für diese Bibliotheken. Im Fall von Python werden sie **Module** genannt.

source: Thankfully, it is easy to import a library of code. If we want to use the "arcade" library, all we need to do is add ``import arcade`` at the top of our program.
de: Zum Glück ist es einfach eine Code-Bibliothek zu importieren. Wenn wir die Bibliothek "arcade" einbinden wollen, müssen wir nur ``import arcade`` am Anfang unseres Programms einfügen.

source: Libraries should always be imported at the **top** of your program. Only comments should appear ahead of an ``import`` statement. Technically, you *can* put the ``import`` statement somewhere else, just like technically you *can* wear a pair of shorts on your head. But don't. Trust me on this.
de: Bibliotheken sollten immer am **Anfang** deines Programms importiert werden. Nur Kommentare sollten vor der ``import``-Anweisung stehen. Im Prinzip *kannst* du die ``import``-Anweisung irgendwo anders eingeben, genauso wie du im Prinzip deine Unterhosen über den Kopf ziehen kannst. Mach es einfach nicht, glaub mir einfach.

source: In the code below, we've imported the arcade library. If you run the code, yet again nothing will happen. We've asked to load the arcade library, but we haven't *done* anything with it yet. That's our next step.
de: Im Programm unten haben wir die arcade-Bibliothek importiert. Wenn wir das Programm ausführen, wird trotzdem nichts passieren. Wir haben angewiesen, die arcade-Bibliothek zu laden, aber wir *machen* noch nichts mit ihr. Das ist unser nächster Schritt.

source: How to Open a Window for Drawing
de: Wie man ein Fenster zum Zeichnen öffnet

source: Now it is time to open the window. See the command below:
de: Jetzt wird es Zeit das Fenster zu öffnen. Siehe die Anweisung unten:

source: How does this command work? To begin, we select the arcade library with ``arcade``. Then we separate the library from the command we want to call with a period: ``.`` Next, we put in the name of the command to run. Which happens to be ``open_window``.
de: Wie funktioniert die Anweisung? Zuerst wählen wir die arcade-Bibliothek mit ``arcade`` aus. Danach verbinden wir die Anweisung der Bibliothek, die wir ausführen wollen, in diesem Fall ``open_window``, mit einem Punkt ``.``.

source: Commands that we can run are called **functions**.
de: Anweisungen, die wir aufrufen, werden **Funktionen** genannt.

source: Just like the sine and cosine functions in math, we surround the function **parameters** with parenthesis. For example:
de: Genau wie bei Sinus und Kosinus in Mathematik umgeben wir die **Argumente** der Funktion mit runden Klammern. Zum Beispiel:

source: The data we need to pass the function are the parameters. In the case of ``open_window``, we need three parameters:
de: Die Daten die wir der Funktion übergeben müssen sind die Argumente. Im Fall von ``open_window`` benötigen wir drei Argumente:

source: The window width in pixels.
de: Die Breite des Fensters in Pixeln,

source: The window height in pixels.
de: die Höhe des Fensters in Pixeln und

source: The text that will appear on the title bar.
de: der Text, der in der Titelzeile des Fensters erscheinen soll.

source: In the case of width and height, the numbers specify the part of the window you can draw on. The actual window is larger to accommodate the title bar and borders. So a 600x600 window is really 602x632 if you count the title bar and borders.
de: Im Fall der Breite und Höhe, legen die Zahlen den Bereich, in den du zeichnen kannst, fest. Das Fenster ist tatsächlich größer, um die Titelzeile und die Umrandungen einzuschließen. So ist ein 600x600 Pixel großes Fenster tatsächlich 602x632 Pixel groß, wenn du die Titelzeile und Umrandung mit zählst.

source: Wait, how do we know that it was the ``open_window`` function to call? How did we know what parameters to use? The names of the functions, the order of the parameters, is the **Application Program Interface** or "API" for short. You can click here for the `Arcade API`_. Any decent code library will have an API and documentation you can find on the web.
de: Warte. Woher wissen wir, dass wir die Funktion ``open_window`` aufrufen müssen? Woher wissen wir, welche Argumente wir übergeben müssen? Die Namen der Funktionen, die Reihenfolge der Argumente ist das **Application Program Interface** oder kurz "API". Du kannst hier klicken für die `Arcade API`_. Jede anständige Programcode-Bibliothek wird eine API und Dokumentation im Web haben.

source: Below is an example program that will open up a window:
de: Unten ist ein Programm, dass ein Fenster öffnet:

source: Try running the code above. It kind-of works. If you have fast eyes, and a slow computer you might see the window pop open, then immediately close. If your computer is fast, you won't see anything at all because the window closes too fast. Why does it close? Because our program is done! We've ran out of code to execute.
de: Versuche das Programm oben auszuführen. Es wird irgendwie funktionieren. Wenn du schnelle Augen und einen langsamen Rechner hast, wirst du ein Fenster auf gehen und sofort wieder schließen sehen. Wenn dein Rechner schnell ist, wirst du nichts sehen, weil das Fenster sich zu schnell wieder schließt. Warum schließt es sich? Weil das Programm zu Ende ist! Wir haben keinen Programmcode mehr, der noch ausgeführt werden soll.

source: To keep the window open, we need to pause until the user hits the close button. To do this, we'll use the ``run`` command in the Arcade library. The ``run`` command takes no parameters, but even if a function doesn't take parameters, you still need to use parenthesis.
de: Um das Fenster offen zu halten, müssen wir warten, bis der Anwender den Schließen-Knopf drückt. Das erreichen wir, indem wir die Funktion ``run`` in der Arcade-Bibliothek aufrufen. Die ``run``-Funktion hat keine Parameter. Auch wenn sie keine Parameter hat, musst du trotzdem die Klammern angeben.

source: You should get a window that looks something like this:
de: Du solltest ein Fenster erhalten, das so ähnlich aussieht:

source: Clearing the screen
de: Löschen des Fensterinhalts

source: Right now we just have a default white as our background. How do we get a different color? Use the ``set_background_color`` command.
de: Bis jetzt haben wir nur den standardmäßigen weißen Hintergrund verwendet. Wie bekommen wir eine andere Farbe? Benutze die Funktion ``set_background_color``.

source: But by itself, the function doesn't work. You need a two more commands. These tell the Arcade library when you are about to start drawing (``start_render``), and when you are done drawing (``finish_render``).
de: Aber für sich allein wird die Funktion nicht funktionieren. Wir benötigen zwei weitere Funktionen. Diese teilen der Arcade-Bibliothek mit, wenn wir anfangen zu zeichnen (``start_render``) und wenn wir fertig mit Zeichnen sind (``finish_render``).

source: See below:
de: Siehe unten:

source: Specifying Colors
de: Farben angeben

source: Wait, where did ``AIR_SUPERIORITY_BLUE`` come from? How do I get to choose the color I want? There are two ways to specify colors:
de: Warte. Wo kam ``AIR_SUPERIORITY_BLUE`` her? Wie kann ich die Farben auswählen, die ich möchte? Es gibt zwei Wege die Farben anzugeben:

source: Look at the `arcade.color API documentation`_ and specify by name.
de: Sieh in die `arcade.color API documentation`_ und wähle sie über ihren Namen aus.

source: Specify the RGB or RGBA color.
de: Gib die Farbe als RBG- oder RGBA-Wert an.

source: To specify colors by name, you can look at the color API documentation and use something like ``arcade.color.AQUAMARINE`` in your program. Then color names come from the ColorPicker `color chart`_.
de: Um die Farbe mit ihrem Namen anzugeben, kannst du in der color-API-Dokumentation nachsehen und etwas wie ``arcade.color.AQUAMARINE`` in deinem Programm verwenden. In diesem Fall kommen die Namen vom ColorPicker `color chart`_ (Farbtabelle).

source: If the color you want isn't in the chart, or you just don't want to use that chart, you can specify colors by "RGB". RGB stands for Red, Green, and Blue.
de: Wenn die Farbe nicht in der Farbtabelle ist oder du die Farbtabelle nicht benutzen möchtest, kannst du die Farbe mit "RBG" angeben. RGB steht für Rot, Grün und Blau.

source: Computers, TVs, color changing LEDs, all work by having three small lights close together. A red light, a green light, and a blue light. Turn all three lights off and you get black. Turn all three lights on and you get white. Just turn on the red, and you get red. Turn on both red and green to get yellow.
de: Rechner, Fernseher, farbwechselnde LEDs, alle funktionieren, indem sie drei kleine Leuchtelemente dicht beieinander haben. Ein rotes, ein grünes und ein blaues Leuchtelement. Schalte alle Leuchtelemente aus und du erhältst Schwarz. Schalte alle an und du erhältst weiß. Schalte nur das rote an und du erhältst Rot. Schalte rot und grün an und du bekommst Gelb.

source: RGB based monitors work on an *additive* process. You start with black and add light to get color.
de: RGB-Monitore arbeiten mit der *additiven* Farbmischung. Du fängst mit schwarz an und fügst Licht hinzu, um eine Farbe zu bekommen.

source: This is different than paint or ink, which works on a *subtractive* process. You start with white and add to get darker colors.
de: Das ist anders als bei Farbe oder Tinte, die mit einem *subtraktiven* Prozess arbeitet. Du startest mit Weiß und fügst Pigmente hinzu, damit es dunkler wird.

source: Therefore, keep separate in your mind how light-based RGB color works from how paint and ink works.
de: Unterscheide deshalb immer im Kopf, wie Licht basierte RGB-Farben funktionieren und wie Farbe und Tinte funktioniert.

source: We specify how much red, green, and blue to use using numbers. No light is zero. Turn the light on all the way and it is 255. So ``(0, 0, 0)`` means no red, no green, no blue. Black. Here are some other examples:
de: Wir müssen mit Zahlen angeben wie viel Rot, Grün und Blau wir haben wollen. Kein Licht ist Null. Komplett angeschaltet ist 255. ``(0, 0, 0)`` bedeutet also kein Rot, kein Grün und kein Blau. Schwarz. Hier sind noch ein paar Beispiele:

source: Red
de: Rot

source: Green
de: Grün

source: Blue
de: Blau

source: Color
de: Farbe

source: Black
de: Schwarz

source: White
de: Weiß

source: Gray
de: Grau

source: Yellow
de: Gelb

source: There are tools that let you easily find a color, and then get the RGB values. One I really like, because it is easy to remember is "`colorpicker.com <http://www.colorpicker.com>`_". You can select the color, and then get the numbers to use when specifying a color. See the image below:
de: Es gibt Werkzeuge, mit denen du leicht eine Farbe findest und dann die RGB-Werte dazu bekommst. Eins, das ich wirklich mag, weil es sich leicht merken lässt, ist "`colorpicker.com <http://www.colorpicker.com>`_". Du kannst die Farbe auswählen und bekommst dann die Zahlen, die du für die Farbe angeben musst. Siehe die Abbildung unten:

source: After getting the number, specify the color as a set of three numbers surrounded by parenthesis, like this:
de: Wenn du die Zahlen hast, gib sie als Liste von drei eingeklammerten Zahlen an, wie hier gezeigt:

source: In addition to RGB, you can also specify "Alpha." The "Alpha Channel" controls how transparent the color is. If you draw a square with an alpha of 255, it will be solid and hide everything behind it. An alpha of 127 will be in the middle, you will see some of the items behind the square. An alpha of 0 is completely transparent and you'll see nothing of the square.
de: Zusätzlich zu den RGB-Werten, kannst du den "Alphawert" angeben. Der "Alpha-Kanal" gibt an, wie durchsichtig die Farbe ist. Wenn du ein Quadrat mit dem Alphawert 255 zeichnest, wird es solide und versteckt alles hinter ihm. Bei einem Alphawert von 127 wird es halb durchsichtig und du siehst Dinge hinter dem Quadrat durchscheinen. Ein Alphawert von 0 bedeutet komplett durchsichtig und du wirst das Quadrat nicht sehen.

source: Wait, What Is Up With 255?
de: Warte, warum 255?

source: Notice how the color values go between 0 and 255? That's strange. Why 255? Why not 100? Why not 1000?
de: Hast du bemerkt, dass die Werte von 0 bis 255 gehen? Das ist merkwürdig. Warum 255? Warum nicht 100? Warum nicht 1000?

source: The reason is important to understand how computers work. Remember how everything is stored in numbers? They are not just stored in numbers, they are stored in 1's and 0's.
de: Der Grund ist wichtig, um zu verstehen wie Rechner funktionieren. Erinnerst du dich, dass alles als Zahlen gespeichert wird? Sie sind nicht nur als Zahlen gespeichert. Sie sind gespeichert als Einsen und Nullen.

source: Everything to the compute is a switch. If there is electricity, we have a 1. If there is no electricity we have a 0. We can store those 1's and 0's in memory. We call these 1's and 0's **binary numbers**.
de: Alles zum Rechnen ist ein Schalter. Wenn Elektrizität da ist, haben wir eine Eins. Wenn keine Elektrizität da ist, haben wir eine Null. Wir können diese Einsen und Nullen im Speicher ablegen. Wir nennen diese Einsen und Nullen **Binärzahlen**.

source: How do we go from 1's and 0's to numbers we normally use? For example, a number like 758? We do that with a combination of 1's and 0's. Like this:
de: Wie kommen wir von den Einsen und Nullen zu den Zahlen, die wir normalerweise verwenden? Nehmen wir als Beispiel 758. Wir stellen das als eine Kombination von Einsen und Nullen dar. So wie hier:

source: Binary - Base 2
de: Binär - Basis 2

source: Base 10
de: Dezimal - Basis 10

source: See the pattern? It is the same pattern we use when we count as a kid. As a kid we learned to go 0 to 9, then when we hit 9 we go back to 0 and add one to the ten's place. Here we only have 0 to 1 instead of 0 to 9. And instead of a "ten's place" we have a "two's place."
de: Siehst du das Muster? Es ist das Muster mit dem wir als Kinder gezählt haben. Als Kind haben wir gelernt von Null bis Neun zu zählen, wenn wir Neun erreicht haben, fangen wir wieder bei Null an und fügen eine Eins an der Zehnerstelle hinzu. Hier haben wir nur 0 und 1 anstellen von 0 bis 9. Anstelle einer "Zehnerstelle" haben wir eine "Zweierstelle".

source: You might have used "bases" in math class long ago. Computers work in Base-2 because they only have two ways to count, on or off. Humans think in Base-10 because we have 10 fingers.
de: Eventuell hast du im Mathematikunterricht vor langer Zeit Basen verwendet. Rechner arbeiten zur Basis 2, weil sie nur zwei Wege zu zählen haben, an oder aus. Menschen denken zur Basis 10, weil wir zehn Finger haben.

source: Numbers are stored in **bytes**. A byte is a set of eight binary numbers. If we were to follow the pattern we started above, the largest number we could store with eight 1's and 0's is::
de: Zahlen werden als **Bytes** gespeichert. Ein Byte ist eine Menge von acht binären Ziffern. Wenn wir dem Muster oben folgen, ist die größte Zahl, die wir speichern können aus acht Einsen und Nullen:

source: In Base-10 this is 255.
de: Zur Basis 10 ist das 255.

source: Let's use some math. We have 8 ones and zeros. That give us 2 :sup:`8` = 256 possible numbers. Since zero is a combination, that makes the biggest number 255.
de: Lass uns etwas Mathematik verwenden. Wir haben acht Einsen und Nullen. Das gibt uns 2:sup:`8` = 256 mögliche Zahlen. Da Null eine Kombination ist, ergibt das, dass 255 die größte Zahl ist.

source: If we had 16 bits, then we'd have 2 :sup:`16` = 65,536 possible combinations. Or a number from 0-65535. A 32-bit computer can hold numbers up to 2 :sup:`32` = 4,294,967,296. A 64-bit computer can hold really large numbers!
de: Wenn wir 16 Bit hätten, hätten wir 2 :sup:`16` = 65.536 mögliche Kombinationen oder eine Zahl von 0 bis 65535. Ein 32-Bit-Rechner kann Zahlen von 0 bis zu 2 :sup:`32` = 4.294.967.295 speichern. Ein 64-Bit-Rechner kann wirklich große Zahlen verarbeiten.

source: So because a computer holds colors with one byte for red, one for green, and one for blue, each color has a value range from 0 - 255.
de: Weil der Rechner Farben mit je einem Byte für Rot, Grün und Blau speichert hat jede Farbe einen Bereich von 0 bis 255.

source: The Coordinate System
de: Das Koordinatensystem

source: In your math classes, you've learned about the Cartesian coordinate system, which looks like this:
de: Im Mathematikunterricht hast du das kartesische Koordinatensystem kennengelernt, das wie folgt aussieht:

source: Source: `Wikipedia: Cartesian coordinate system <https://commons.wikimedia.org/wiki/File:Cartesian_coordinate_system_(comma).svg>`_
de: Quelle: `Wikipedia: Cartesian coordinate system <https://commons.wikimedia.org/wiki/File:Cartesian_coordinate_system_(comma).svg>`_

source: Our graphics will be drawn using this same system. But there are additional things to keep in mind:
de: Unsere Grafiken wird mit dem gleichen System gezeichnet. Es gibt aber ein paar Dinge zu beachten:

source: We will only draw in the upper right quadrant. So 0,0 will be in the lower left of the screen, and all negative coordinates will be off-screen.
de: Wir werden nur im rechten, oberen Quadranten zeichnen. 0, 0 ist die untere linke Ecke des Zeichenbereichs und alle negativen Werte sind außerhalb des Zeichenbereichs.

source: Each "Point" will be a pixel. So a window that is 800 pixels wide, will have x-coordinates that run from 0 to 800.
de: Jeder "Punkt" ist ein Pixel. Ein Fenster, das 800 Pixel breit ist, hat X-Koordinaten von 0 bis 799.

source: Drawing a Rectangle
de: Ein Rechteck zeichnen

source: Let's start drawing with a program to draw a rectangle. The function we will use is ``draw_lrtb_rectangle_filled``. It stands for "draw left-right-top-bottom rectangle".
de: Lass uns mit einem Programm zum Zeichnen eines Rechtecks anfangen. Die Funktion, die wir verwenden werden, ist ``draw_lrtb_rectangle_filled``. Es steht für "draw left-right-top-bottom rectangle" (zeichne links-rechts-oben-unten Rechteck).

source: We'll use this program to draw a green rectangle:
de: Wir verwenden dieses Programm, um ein grünes Rechteck zu zeichnen:

source: There are a lot of shapes we can draw. Try running the program below:
de: Es gibt eine Menge Formen, die wir zeichnen können. Versuch das Programm unten auszuführen:

source: Drawing Primitives
de: Zeichen-Primitive
